# Задание 3
#
#
#
# Напишите программу, принимающую строку от пользователя
# и выводящую символы этой строки с четными индексами (используйте input())


my_string = input()
result = my_string[::2]
print(result)

